\documentclass{article}
\usepackage[utf8]{inputenc}
\usepackage{listings}
\lstset{
    language=Octave,
    frame=single,
}
\usepackage[T2A]{fontenc}
\usepackage[utf8]{inputenc}
\usepackage[russian]{babel}
\usepackage[left=2cm,right=2cm,top=2cm,bottom=2.1cm,bindingoffset=0cm]{geometry}
\usepackage{mathtools}

\title{Математическая Статистика}
\author{Курбатов Егор М3238}

\begin{document}
\maketitle
\begin{center}
    Метод Монте-Карло \\
    Вариант №11
\end{center}

\section{Оценка объёма}
    \subsection{Задание}
        Методом Монте-Карло оценить объем части тела \{$F(\tilde x) \leq c$\}, заключенной в $k$-мерном кубе с ребром $[0, 1]$. 
        Функция имеет вид $F(\tilde x) = f(x_1) + f(x_2) + ... + f(x_k)$.
        Для выбранной надежности $\gamma \geq 0.95$ указать асимптотическую точность оценки и построить асимптотический доверительный интервал для истинного значения объёма. \\
        Используя объём выборки $n = 10^4$ и $n = 10^6$, оценить скорость сходимости и показать, что доверительные интервалы пересекаются.
    \subsection{Входные данные}
        \begin{itemize}
            \item Функция имеет вид $f(x) = \exp(-0.35*x)$
            \item Куб размерностью $k = 10$
            \item Параметр $c = 8.8$ 
        \end{itemize}
    \subsection{Исходный код программы}
        \begin{minipage}{\linewidth}
            \begin{verbatim}
            
            pkg load statistics;

            function monte_carlo(n)
                c = 8.8;
                y = 0.95;
                k = 10; 
                Q = norminv((y + 1) / 2);
                X = rand(k, n);
                F_x = sum(exp(-0.35 .* X));
                In = mean(F_x <= c);
                delta = Q * sqrt(In * (1 - In) / n);
                printf("N = %d\n", n);
                printf("Volume is %g (from %g to %g)\n", In, In - delta, In + delta);
                printf("Delta is %g\n\n", delta); 
            endfunction

            monte_carlo(10000);
            monte_carlo(1000000);
            
            \end{verbatim}
        \end{minipage}
    \subsection{Выходные данные}
        \begin{minipage}{\linewidth}
            \begin{verbatim}

            N = 10000
            Volume is 0.9137 (from 0.908196 to 0.919204)
            Delta is 0.00550371

            N = 1000000
            Volume is 0.908976 (from 0.908412 to 0.90954)
            Delta is 0.00056377

            \end{verbatim}
        \end{minipage}
    \subsection{Вывод}
        Доверительный интервал при $n = 10^6$ содержится в интервале при $n = 10^4$.\\
        При увеличении числа итераций в $100$ раз ширина доверительного интервала уменьшилось в $10$ раз.
\section{Оценка Интеграла}
    \subsection{Задание}
    Построить оценку интегралов (представить интеграл как математическое ожидание функции,
    зависящей от случайной величины с известной плотностью) и для выбранной надежности $\gamma \geq 0.95$ указать
    асимптотическую точность оценки и построить асимптотический доверительный интервал для истинного
    значения интеграла. 
    \subsection{Интеграл 1}
        \subsubsection{Входные данные}
            \begin{itemize}
                \item Интеграл имеет вид ${\displaystyle \int\limits_{0}^{\infty}\sqrt{1 + x^2} \cdot exp(-3x) dx}$
            \end{itemize}
        \subsubsection{Исходный код программы}
        \begin{minipage}{\linewidth}
            \begin{verbatim}
            
            pkg load statistics;

            function [res] = g(x)
                res = sqrt(x .^ 2 .+ 1);
            endfunction

            function [res] = f(x)
                res = g(x) * exp(-3 .* x);
            endfunction

            function monte_carlo(n)
                j = 3;
                y = 0.95;
                Q = norminv((y + 1) / 2);
                X = exprnd(1/j, 1, n);
                F_x = g(X) .* 1/j;
                V = mean(F_x);
                delta = (std(F_x) * Q) / sqrt(n);
                printf("N = %d\n", n);
                printf("Value is %g (from %g to %g)\n", V, V - delta, V + delta);
                printf("Delta is %g\n\n", delta);
            endfunction

            printf("Sample answer = %g\n\n", quad(@f, 0, inf));
            monte_carlo(10000);
            monte_carlo(1000000);
            
            \end{verbatim}
        \end{minipage}
        \subsubsection{Выходные данные}
         \begin{minipage}{\linewidth}
            \begin{verbatim}

            Sample answer = 0.364129

            N = 10000
            Value is 0.363943 (from 0.362841 to 0.365044)
            Delta is 0.00110194

            N = 1000000
            Value is 0.364102 (from 0.363991 to 0.364213)
            Delta is 0.000111015

            \end{verbatim}
        \end{minipage}
        \subsubsection{Вывод}
        Истинное значение интеграла содержится в доверительном интервале при $n = 10^4$ и $n = 10^6$. Значение, полученное методом Монте-Карло отличается от значения, полученного методом $quad$, на $2.7 \cdot 10^{-5}$.\\
        При увеличении числа итераций в $100$ раз, ширина доверительного интервала уменьшилось в $10$ раз.
    \subsection{Интеграл 2}
        \subsubsection{Входные данные}
            \begin{itemize}
                \item Интеграл имеет вид ${\displaystyle \int\limits_{4}^{9} \frac{\ln{x}}{x + 1} dx}$
            \end{itemize}
        \subsubsection{Исходный код программы}
        \begin{minipage}{\linewidth}
            \begin{verbatim}
            
            pkg load statistics;

            function res = f(x)
                res = log(x) ./ (x .+ 1);
            endfunction

            function monte_carlo(n)
                L = 4;
                R = 9;
                y = 0.95;
                Q = norminv((y + 1) / 2);
                X = unifrnd(L, R, 1, n);
                F_x = f(X) .* (R - L);
                V = mean(F_x);
                delta = (std(F_x) * Q) / sqrt(n);
                printf("N = %d\n", n);
                printf("Value is %g (from %g to %g)\n", V, V - delta, V + delta);
                printf("Delta is %g\n\n", delta); 
            endfunction

            printf("Sample answer = %g\n\n", quad(@f, 4, 9));
            monte_carlo(10000);
            monte_carlo(1000000);
            
            \end{verbatim}
        \end{minipage}
        \subsubsection{Выходные данные}
        \begin{minipage}{\linewidth}
            \begin{verbatim}

            Sample answer = 1.24742

            N = 10000
            Value is 1.24722 (from 1.24551 to 1.24894)
            Delta is 0.00171548

            N = 1000000
            Value is 1.24741 (from 1.24724 to 1.24758)
            Delta is 0.000170842

            \end{verbatim}
        \end{minipage}
        \subsubsection{Вывод}
        Истинное значение интеграла содержится в доверительном интервале при $n = 10^4$ и $n = 10^6$. Значение, полученное методом Монте-Карло отличается от значения, полученного методом $quad$, на $10^{-5}$.\\
        При увеличении числа итераций в $100$ раз, ширина доверительного интервала уменьшилось в $10$ раз.
\end{document}
